# Zadanie 4 - Jan Brodowicz

In [2]:
import pandas as pd

***Data frame:***

In [10]:
d = {"Name": ["Jan", "Michał", "Jakub", "Ania", "Maciej"],                  # tworzę słownik na postawie, którego 
     "Surname": ["Brodowicz", "Przygiel", "Marchewka", "Cebula", "Boguś"],  # stworzony zostanie data frame
     "Age": [20, 21, 22, 23, 24], 
     "Sex": ["male", "male", "male", "female", "male"]}
df = pd.DataFrame(data=d)  # tworzę dataframe
df.index = df.index + 1    # indeksuję od 1 zamiast od 0
df  # wyświetlam dataframe

     Name    Surname  Age     Sex
1     Jan  Brodowicz   20    male
2  Michał   Przygiel   21    male
3   Jakub  Marchewka   22    male
4    Ania     Cebula   23  female
5  Maciej      Boguś   24    male

***Informacje o danych:***

In [8]:
df.info()  # informacje o danych

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 1 to 5
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     5 non-null      object
 1   Surname  5 non-null      object
 2   Age      5 non-null      int64
 3   Sex      5 non-null      object
dtypes: int64(1), object(3)
memory usage: 292.0+ bytes

***Opis danych:***

In [11]:
df.describe()  # opis danych

             Age
count   5.000000
mean   22.000000
std     1.581139
min    20.000000
25%    21.000000
50%    22.000000
75%    23.000000
max    24.000000

***Pierwsze trzy rekordy:***

In [12]:
df.head(3)  # wyświetlam pierwsze 3 rekordy

     Name    Surname  Age   Sex
1     Jan  Brodowicz   20  male
2  Michał   Przygiel   21  male
3   Jakub  Marchewka   22  male